<?php

return [
    'category' => [
        'added' => 'Категория успешно добавлена',
        'updated' => 'Категория успешно обновлена',
        'deleted' => 'Категория успешно удалена',
    ],
    'comment' => [
        'updated' => 'Комментарий успешно обновлен',
        'deleted' => 'Комментарий успешно удален'
    ],
    'invalid' => [
        'credentials' => 'Неверный логин или пароль',
    ],
    'post' => [
        'added' => 'Пост успешно добавлен',
        'updated' => 'Пост успешно обновлен',
        'deleted' => 'Пост успешно удален',
    ],
    'group' => [
        'added' => 'Группа успешно добавлена',
        'updated' => 'Группа успешно обновлена',
        'deleted' => 'Группа успешно удалена',
    ],
    'successfully' => [
        'updated' => 'Успешно обновлено'
    ],
    'tag' => [
        'added' => 'Тег успешно добавлен',
        'updated' => 'Тег успешно обновлен',
        'deleted' => 'Тег успешно удален',
    ],
    'user' => [
        'added' => 'Пользователь успешно добавлен',
        'updated' => 'Пользователь успешно обновлен',
        'deleted' => 'Пользователь успешно удален',
    ],
    'common' => [
        'registration_success' => 'Вы успешно зарегистрировались!',
        'enter_search_query' => 'Введите поисковый запрос',
        'profile_updated' => 'Профиль успешно обновлен',
        'email_already_confirmed' => 'Email уже подтвержден',
        'verification_link_sent' => 'Ссылка для верификации отправлена!',
    ],
    'exception' => [
        'category' => [
            'add' => 'Ошибка добавления категории: ',
            'update' => 'Ошибка обновления категории: ',
            'delete' => 'Ошибка удаления категории: '
        ],
        'comment' => [
            'add' => 'Ошибка добавления комментария: ',
            'update' => 'Ошибка обновления комментария: ',
            'delete' => 'Ошибка удаления комментария: '
        ],
        'post' => [
            'add' => 'Ошибка добавления поста: ',
            'update' => 'Ошибка обновления поста: ',
            'delete' => 'Ошибка удаления поста: '
        ],
        'role' => [
            'add' => 'Ошибка добавления группы: ',
            'update' => 'Ошибка обновления группы: ',
            'delete' => 'Ошибка удаления группы: '
        ],
        'setting' => [
            'update' => 'Ошибка обновления настройки: '
        ],
        'tag' => [
            'add' => 'Ошибка добавления тега: ',
            'update' => 'Ошибка обновления тега: ',
            'delete' => 'Ошибка удаления тега: '
        ],
        'user' => [
            'add' => 'Ошибка добавления пользователя: ',
            'update' => 'Ошибка обновления пользователя: ',
            'delete' => 'Ошибка удаления пользователя: '
        ],
        'register' => [
            'add' => 'Ошибка регистрации: '
        ]
    ]
];
